import React from "react";

const TextWrapper = () => {
  return (
    <div className="text-wrapper">
      <h2 className="title">Грижи за дрехите</h2>
      <h6 className="text">
        Като се грижите за дрехите си, вие се грижите за околната среда.
      </h6>
      <h6 className="text">
        С този наръчник за грижи за дрехите бихме искали да Ви помогнем да
        удължите живота на облеклата си и да намалите влиянието на процесите на
        грижа върху околната среда. Следвайки този наръчник, може да намалите
        износването на дрехите и количествата на вода и енергия, които
        потребявате при прането, сушенето и грижите за Вашите дрехи.
      </h6>
    </div>
  );
};

export default TextWrapper;
