import React from "react";
import "./blog-page.css";

const blogContent = [
  {
    id: 2,
    number: "01.",
    section: "ПРОВЕТРЯВАЙТЕ ДРЕХИТЕ СИ",
    side: "left",
    text: `Закачайте дрехите си на открито, за да ги проветрявате. Прането на
    дрехите е процес, който постепенно износва тъканите, като в същото
    време потребява вода и енергия. Понякога трябва просто да
    проветрите дрехите си или да ги изчеткате, за да бъдат отново като
    нови.`,
  },
  {
    id: 3,
    side: "right",
    number: "02.",
    section: "ПЪЛНЕТЕ ПЕРАЛНЯТА",
    text: `Всяко пране консумира вода и енергия и ако пералнята не е пълна, дрехите Ви ще се износват повече. Като изчаквате пералнята да се напълни, намалявате броя пранета и по този начин помагате за намаляване на влиянието върху околната среда. Имайте предвид, обаче, че пълненето влияе върху резултата от прането. Затова, ако я напълните прекалено, дрехите Ви може да не се изперат добре.`,
  },
  {
    id: 4,
    side: "left",
    number: "03.",
    section: "ПЕРЕТЕ НА НИСКА ТЕМПЕРАТУРА",
    text: `
    Прането на ниска температура е по-щадящо за дрехите, помага за запазване на цветовете и потребява по-малко енергия, като по този начин намалява емисиите на CO2. Поддържайте дрехите си чисти, като ги перете на по-ниски температури.
    `,
  },
  {
    id: 5,
    number: "04.",
    side: "center",
    section: "ЛЕКО ЦЕНТРОФУГИРАНЕ",
    text: `Когато перете, използвайте програма с лека центрофуга. Лекото центрофугиране намалява образуването на фитилчета и Ви помага в грижите за дрехите, като по този начин намалява въздействието върху околната среда чрез по-слабо отделяне на микровлакна.`,
  },
  {
    id: 6,
    number: "05.",
    side: "left",

    section: "ОБРЪЩАЙТЕ ДРЕХИТЕ СИ НАОПАКИ",
    text: `За да намалите износването на дрехите при процеса на пране, може да ги обърнете наопаки. По този начин ще допринесете за запазването на цветовете и ще помогнете на тъканите да съхранят оригиналните качества на дрехата.`,
  },
  {
    id: 7,
    number: "06.",
    side: "right",

    section: "ПРОСТИРАЙТЕ ДРЕХИТЕ",
    text: `
    Сушилнята консумира много енергия. Простирането на дрехите вместо използването на сушилня подпомага грижите за дрехите, тъй като намалява износването на тъканите, мачка ги по-малко, не свива дрехите, избягва образуването на фитилчета и освен това не потребява електричество.`,
  },
  {
    id: 8,
    number: "07.",
    side: "left",

    section: "ГРИЖЕТЕ СЕ ЗА ТРИКОТАЖА",
    text: `Трикотажните облекла са еластични и затова, когато ги простирате, могат да загубят първоначалната си форма. За да не се деформират, сушете ги в хоризонтално положение и ги съхранявайте сгънати в гардероба. Освен това, за да запазят първоначалната си еластичност, перете ги на ръка или с програми за фино пране.`,
  },
  {
    id: 9,
    number: "08.",
    side: "right",

    section: "ПРОФЕСИОНАЛНО ПРАНЕ",
    text: `
    Ако е необходимо професионално почистване на облеклата, опитайте се да намерите ателиета за химическо чистене, които имат системи за влажно почистване на дрехите, подходящи за този тип третиране, или системи за сухо почистване, които използват по-щадящи за околната среда технологии.`,
  },
  {
    id: 10,
    number: "9.",
    side: "left",

    section: "ГРИЖА ЗА АКСЕСОАРИТЕ",
    text: `
    Простички действия като почистване на аксесоарите с влажна памучна кърпа или мека четка може да подпомогнат грижите и да намалят влиянието върху околната среда. Когато е възможно, търсете почистващи продукти, които щадят околната среда.`,
  },
  {
    id: 11,
    number: "10.",
    side: "right",

    section: "И НАКРАЯ, РЕЦИКЛИРАЙТЕ",
    text: `
    Когато вече не използвате дрехите си, не ги изхвърляйте, а ги донесете в нашите магазини, за да им вдъхнем нов живот.`,
  },
];

const Blog = () => {
  return (
    <div className="container">
      <div id="blogLayout">
        <div className="block" id="block1">
          <div className="img-wrapper">
            <img
              id="img1"
              alt=""
              src="https://cdn.shopify.com/s/files/1/0264/7742/8813/files/clothing-care.jpg?v=1581476432"
            ></img>
          </div>
          <div className="text-wrapper">
            <h2 className="title">Грижи за дрехите</h2>
            <h6 className="text">
              Като се грижите за дрехите си, вие се грижите за околната среда.
            </h6>
            <h6 className="text">
              С този наръчник за грижи за дрехите бихме искали да Ви помогнем да
              удължите живота на облеклата си и да намалите влиянието на
              процесите на грижа върху околната среда. Следвайки този наръчник,
              може да намалите износването на дрехите и количествата на вода и
              енергия, които потребявате при прането, сушенето и грижите за
              Вашите дрехи.
            </h6>
          </div>
        </div>
        {blogContent.map((el) => {
          return (
            <div className="block" id={`block${el.id}`}>
              <div className={`text-wrapper ${el.side}`}>
                <h4 className="number">{el.number}</h4>
                <h3 className="section">{el.section}</h3>
                <h6 className="text typeWriter">{el.text}</h6>
              </div>
            </div>
          );
        })}
      </div>
    </div>
  );
};

export default Blog;
